# PROJET 3 ( GROUPE No 3)
## NETFLIX RECOMMENDATION SYSTEM

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt
import time

In [3]:
rating = pd.read_csv('../../../Datasets/ratings.csv')

In [4]:
rating = rating.drop(['timestamp', 'userId'], axis=1)

In [5]:
rating.head()

   movieId  rating
0      307     3.5
1      481     3.5
2     1091     1.5
3     1257     4.5
4     1449     4.5

In [6]:
movie = pd.read_csv('../../../Datasets/movies.csv')

In [7]:
movie.genres = movie.genres.str.split('|')

In [9]:
movie = movie.explode('genres')

In [10]:
movie.head()

   movieId             title     genres
0        1  Toy Story (1995)  Adventure
0        1  Toy Story (1995)  Animation
0        1  Toy Story (1995)   Children
0        1  Toy Story (1995)     Comedy
0        1  Toy Story (1995)    Fantasy

In [11]:
df_movies = pd.merge(rating, movie, on='movieId')

In [13]:
df_movies.head()

   movieId  rating                                             title genres
0      307     3.5  Three Colors: Blue (Trois couleurs: Bleu) (1993)  Drama
1      307     4.0  Three Colors: Blue (Trois couleurs: Bleu) (1993)  Drama
2      307     4.0  Three Colors: Blue (Trois couleurs: Bleu) (1993)  Drama
3      307     5.0  Three Colors: Blue (Trois couleurs: Bleu) (1993)  Drama
4      307     3.0  Three Colors: Blue (Trois couleurs: Bleu) (1993)  Drama